<a href="https://colab.research.google.com/github/tuentt12/Data-Analysis-With-Python-EX/blob/main/W5_D1_Time%26GetDummies.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# A. Time in Pandas

**Pandas** was developed in the context of financial modeling, so as you might expect, it contains a fairly extensive set of tools for working with dates, times, and time-indexed data. Date and time data comes in a few flavors, which we will discuss here:

***Time stamps*** reference particular moments in time (e.g., July 4th, 2015 at 7:00am).

![](https://miro.medium.com/max/1400/1*8uf_T4BqN0s5gbwWaPmXFg.png)

***Time intervals*** and ***periods*** reference a length of time between a particular beginning and end point; for example, the year 2015. Periods usually reference a special case of time intervals in which each interval is **of uniform length and does not overlap** (e.g., 24 hour-long periods comprising days).

![](https://miro.medium.com/max/1400/1*J1WOPRKuctCC_eAgQ-RwTw.png)

***Time deltas*** or ***durations*** reference an exact length of time (e.g., a duration of 22.56 seconds).

In this section, we will introduce how to work with each of these types of date/time data in Pandas. This short section is by no means a complete guide to the time series tools available in Python or Pandas, but instead is intended as a broad overview of how you as a user should approach working with time series. 

We will start with a brief discussion of tools for dealing with dates and times in Python, before moving more specifically to a discussion of the tools provided by Pandas. After listing some resources that go into more depth, we will review some short examples of working with time series data in Pandas.

## 1. Parse and Extract Time

The group of following functions help convert the time in normal string format into Pandas time datatype.

```python
pd.to_datetime()
pd.to_timedelta()
```

**Example 1**: Convert the launched timestamps into Pandas datetime datatype

In [ ]:
example = pd.DataFrame({'begin':['4th of July, 2015',
                                 '2015-Jul-6', 
                                 '07-07-2015', 
                                 '20150708'],
                        'end':['2015-11-02',
                               '2015-11-03',
                               '2015-12-08',
                               '2016-03-20']})

In [ ]:
example

               begin         end
0  4th of July, 2015  2015-11-02
1         2015-Jul-6  2015-11-03
2         07-07-2015  2015-12-08
3           20150708  2016-03-20

In [ ]:
example.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   begin   4 non-null      object
 1   end     4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [ ]:
pd.to_datetime(example['begin'])

0   2015-07-04
1   2015-07-06
2   2015-07-07
3   2015-07-08
Name: begin, dtype: datetime64[ns]

In [ ]:
example['begin'] = pd.to_datetime(example['begin'])
example['end'] = pd.to_datetime(example['end'])

In [ ]:
example

       begin        end
0 2015-07-04 2015-11-02
1 2015-07-06 2015-11-03
2 2015-07-07 2015-12-08
3 2015-07-08 2016-03-20

In [ ]:
example.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   begin   4 non-null      datetime64[ns]
 1   end     4 non-null      datetime64[ns]
dtypes: datetime64[ns](2)
memory usage: 192.0 bytes

After convert to the Pandas timestamp datatype, you can continue using the syntax to extract detail in a more specific level.

On a ```datetime``` datatype column, you can simply call `<column_name>.dt.<time_unit>` to extract the value out.

```python
date_series.dt.year
date_series.dt.month
date_series.dt.day
date_series.dt.hour
date_series.dt.minute
date_series.dt.second
date_series.dt.week
date_series.dt.weekday
date_series.dt.quarter
```

In the case of weekday, it will return value from 0 to 6, which is corresponding to 'Mon' to 'Sun'

In [ ]:
example['begin']

0   2015-07-04
1   2015-07-06
2   2015-07-07
3   2015-07-08
Name: begin, dtype: datetime64[ns]

In [ ]:
example['begin'].dt.day

0    4
1    6
2    7
3    8
Name: begin, dtype: int64

In [ ]:
example['begin'].dt.quarter

0    3
1    3
2    3
3    3
Name: begin, dtype: int64

## 2. Calculate time

You can also perform calculation on the a Pandas datatime column.

In [ ]:
example

       begin        end
0 2015-07-04 2015-11-02
1 2015-07-06 2015-11-03
2 2015-07-07 2015-12-08
3 2015-07-08 2016-03-20

In [ ]:
# Calculate

example['end'] - example['begin']

0   121 days
1   120 days
2   154 days
3   256 days
dtype: timedelta64[ns]

üôãüèª‚Äç‚ôÇÔ∏è **DISCUSSION**: What is the datatype of the output of the above code cell?

A. TimeStamp

B. TimePeriod

C. TimeDelta

D. Float

Similar to ```pd.to_datetime``` for timestamp, we can convert a number into timedelta datatype by calling ```pd.to_timedelta```. 

The syntax requires the value and the unit (Second, Minute, Hour, Day, etc)
https://pandas.pydata.org/docs/reference/api/pandas.to_timedelta.html

In [ ]:
pd.to_timedelta(30, 'D')

Timedelta('30 days 00:00:00')

In [ ]:
# Convert into month level
(example['end'] - example['begin']) / pd.to_timedelta(30, 'D')

0    4.033333
1    4.000000
2    5.133333
3    8.533333
dtype: float64

For a deeper look into the DateTime datatype and some other common methods in Datetime, you can visit the notebook here: https://colab.research.google.com/drive/1slGIeCKXky0wvZEgFL9KDIrb2pvjCKCj?usp=sharing

# B. Get Dummies

One Hot Encoding is one of the popular task in data analysis. This process helps us to "numerize" categorical for further analysis. One Hot Encoding will break one categorical column into multiple columns where the existence of the category is denoted by 1 and the absence is 0.

In [ ]:
schedule_df = pd.DataFrame({'Name': ['Nhan', 'Trang', 'Minh', 'Quan', 'Ai'],
                     'Workday': ['Thu', 'Fri', 'Sat', 'Fri', 'Fri'],
                     'Shift': ['Morning', 'Night', 'Night', 'Morning', 'Night']})
schedule_df

    Name Workday    Shift
0   Nhan     Thu  Morning
1  Trang     Fri    Night
2   Minh     Sat    Night
3   Quan     Fri  Morning
4     Ai     Fri    Night

In [ ]:
dummies = pd.get_dummies(schedule_df[['Workday', 'Shift']])
dummies

   Workday_Fri  Workday_Sat  Workday_Thu  Shift_Morning  Shift_Night
0            0            0            1              1            0
1            1            0            0              0            1
2            0            1            0              0            1
3            1            0            0              1            0
4            1            0            0              0            1

In [ ]:
dummies = pd.get_dummies(schedule_df[['Workday']])
dummies

   Workday_Fri  Workday_Sat  Workday_Thu
0            0            0            1
1            1            0            0
2            0            1            0
3            1            0            0
4            1            0            0

**How to join it back to the original table?**

In [ ]:
schedule_df

    Name Workday    Shift
0   Nhan     Thu  Morning
1  Trang     Fri    Night
2   Minh     Sat    Night
3   Quan     Fri  Morning
4     Ai     Fri    Night

In [ ]:
dummies

0    0
1    0
2    1
3    0
4    0
Name: Workday_Sat, dtype: uint8

In [ ]:
# The whole dummies table - concatenate
concat_df = pd.concat([schedule_df, dummies], axis=1)

In [ ]:
concat_df

    Name Workday    Shift  Workday_Fri  Workday_Sat  Workday_Thu
0   Nhan     Thu  Morning            0            0            1
1  Trang     Fri    Night            1            0            0
2   Minh     Sat    Night            0            1            0
3   Quan     Fri  Morning            1            0            0
4     Ai     Fri    Night            1            0            0

In [ ]:
concat_df[['Name','Workday_Fri']]

    Name  Workday_Fri
0   Nhan            0
1  Trang            1
2   Minh            0
3   Quan            1
4     Ai            1

In [ ]:
schedule_df.drop('Sat',axis=1,inplace=True)

In [ ]:
schedule_df

    Name Workday    Shift
0   Nhan     Thu  Morning
1  Trang     Fri    Night
2   Minh     Sat    Night
3   Quan     Fri  Morning
4     Ai     Fri    Night

In [ ]:
# Create new column in schedule_df

schedule_df['Sat'] = dummies['Workday_Sat']
schedule_df

    Name Workday    Shift  Sat
0   Nhan     Thu  Morning    0
1  Trang     Fri    Night    0
2   Minh     Sat    Night    1
3   Quan     Fri  Morning    0
4     Ai     Fri    Night    0